#21
# X = брой нови батерии от избраните
# От 2 избрани батерии, новите може да са 0, 1 или 2.

# Фенерчето ще заработи ако изберем 2 нови батерии, 
# няма да заработи ако изберем по-малко от 2 нови.
# P(избираме по-малко от 2 нови)  =  P(X = 0) + P(X = 1) =  1 - P(X = 2)
dhyper(0,5,3,2) + dhyper(1,5,3,2)

#22
# X = брой грешки на 1500 думи
# X ~ Bi(n=1500, p=1/500)
E <- 1500 * (1/500)

# P(X <= 2)
ppois(2, E)

# P(1 <= X <= 3) = P(X <= 3) - P(X <= 0)
pbinom(3, n, p) - pbinom(0, n, p)

#23
# X = брой верни отговори, дадени от Иван на теста
# X ~ Bi(n=10, p=1/4)

# P(X >= 5) = 1 - P(X <= 4)
1 - pbinom(4, 10, 1/4)

#24
# X = брой пътници, които идват навреме
# X ~ Bi(n=143, p=0.92)
# а) P(X <= 138)
pbinom(138, 143, 0.92)

# б) P(X = 137)
dbinom(137, 143, 0.92)

#25
# X = брой проверени батерии до откриване на първата дефектна (вкл.)
# X ~ Ge(p=0.03)

# P(X <= 10)
pgeom(9, 0.03)

######################

# X = брой дефектни батерии измежду 50 проверени
# X ~ Bi(n=50, p=0.03)

# P(X >= 2) = 1 - P(X <= 1)
1 - pbinom(1, 50, 0.03)

#26
# X = брой дефектни батерии измежду 50 проверени от общо 100
# P(X >= 2) = 1 - P(X <= 1)
1 - phyper(1, 3, 97, 50)

#27
# X = брой дефектни батерии измежду 50 проверени от общо 3000
# P(X >= 2) = 1 - P(X <= 1)
1 - phyper(1, 90, 2910, 50)

#28
# X = брой на тестваните хора до срещането на първия с този ген
# X ~ Ge(p=1/10)
# P(X >= 5) = 1 - P(X <= 4)
1 - pgeom(3, 1/10)

# X = брой на тестваните хора до намирането на 10-тия с този ген
# X ~ NB(10, p=1/10)
# P(X >= 50) = 1 - P(X <= 49)
1 - pnbinom(48, 10, 1/10)

#29
# X = брой на възникналите проблеми 
# X ~ Poi(lambda)
# P(X > 3) = 1 - P(X <= 3)
lambda <- (1/90) * 360
1 - ppois(3, lambda)

#30
# X = брой изтеглени купи в образец от 10 карти (от популация 52)
# P(X >= 2) = 1 - P(X <= 1)
1 - phyper(1, 13, 39, 10)

#31
# X = брой изтеглени купи от общо 10 опита всеки с вероятност 13/52
# X ~ Bi(n=10, p=13/52)
# P(X >= 2) = 1 - P(X <= 1)
1 - pbinom(1, 10, 13/52)